In [1]:
import pandas as pd
from datetime import datetime

In [2]:
df = pd.read_csv("rt_vehicles_DB_2018.txt", sep=";")

In [3]:
df.head(10)

,DATASOURCE,DAYOFSERVICE,VEHICLEID,DISTANCE,MINUTES,LASTUPDATE,NOTE
0,DB,23-NOV-18 00:00:00,3303848,286166,58849,04-DEC-18 08:03:09,NaN
1,DB,23-NOV-18 00:00:00,3303847,259545,56828,04-DEC-18 08:03:09,NaN
2,DB,28-FEB-18 00:00:00,2868329,103096,40967,08-MAR-18 10:35:59,NaN
3,DB,28-FEB-18 00:00:00,2868330,147277,43599,08-MAR-18 10:35:59,NaN
4,DB,28-FEB-18 00:00:00,2868331,224682,40447,08-MAR-18 10:35:59,NaN
5,DB,28-FEB-18 00:00:00,2868332,19499,6289,08-MAR-18 10:35:59,NaN
6,DB,28-FEB-18 00:00:00,2868333,133014,43647,08-MAR-18 10:35:59,NaN
7,DB,28-FEB-18 00:00:00,2868334,168964,47167,08-MAR-18 10:35:59,NaN
8,DB,28-FEB-18 00:00:00,2868335,360842,55477,08-MAR-18 10:35:59,NaN
9,DB,28-FEB-18 00:00:00,2868336,139959,39599,08-MAR-18 10:35:59,NaN

In [4]:
df.shape

(272622, 7)

In [5]:
df.dtypes

DATASOURCE       object
DAYOFSERVICE     object
VEHICLEID         int64
DISTANCE          int64
MINUTES           int64
LASTUPDATE       object
NOTE            float64
dtype: object

In [6]:
print('Number of duplicate rows (excluding first occurrence) in the table is:', df.duplicated().sum())

Number of duplicate rows (excluding first occurrence) in the table is: 0

In [7]:
# Display count of unique values for each feature
df.nunique(axis=0)

DATASOURCE           1
DAYOFSERVICE       360
VEHICLEID         1152
DISTANCE        170498
MINUTES          57523
LASTUPDATE         360
NOTE                 0
dtype: int64

In [8]:
# Drop DATASOURCE, NOTE
df.drop(["DATASOURCE", "NOTE"], axis = 1, inplace=True)

In [9]:
df.head()

         DAYOFSERVICE  VEHICLEID  DISTANCE  MINUTES          LASTUPDATE
0  23-NOV-18 00:00:00    3303848    286166    58849  04-DEC-18 08:03:09
1  23-NOV-18 00:00:00    3303847    259545    56828  04-DEC-18 08:03:09
2  28-FEB-18 00:00:00    2868329    103096    40967  08-MAR-18 10:35:59
3  28-FEB-18 00:00:00    2868330    147277    43599  08-MAR-18 10:35:59
4  28-FEB-18 00:00:00    2868331    224682    40447  08-MAR-18 10:35:59

In [10]:
# Define function to convert datetime in format seen in data to timestamp
def to_timestamp(date):
    stamp = int(datetime.timestamp(datetime.strptime(date, '%d-%b-%y %H:%M:%S')))
    return stamp

In [11]:
# Create new dt feature containing datetimes from DAYOFSERVICE converted to timestamp - for consistency across data
# Convert values in LASTUPDATE to timestamp
df["dt"] = df["DAYOFSERVICE"].apply(to_timestamp)
df["LASTUPDATE"] = df["LASTUPDATE"].apply(to_timestamp)

In [12]:
df.head()

         DAYOFSERVICE  VEHICLEID  DISTANCE  MINUTES  LASTUPDATE          dt
0  23-NOV-18 00:00:00    3303848    286166    58849  1543910589  1542931200
1  23-NOV-18 00:00:00    3303847    259545    56828  1543910589  1542931200
2  28-FEB-18 00:00:00    2868329    103096    40967  1520505359  1519776000
3  28-FEB-18 00:00:00    2868330    147277    43599  1520505359  1519776000
4  28-FEB-18 00:00:00    2868331    224682    40447  1520505359  1519776000

In [13]:
df.drop(["DAYOFSERVICE"], axis = 1, inplace=True)

In [14]:
df.head()

   VEHICLEID  DISTANCE  MINUTES  LASTUPDATE          dt
0    3303848    286166    58849  1543910589  1542931200
1    3303847    259545    56828  1543910589  1542931200
2    2868329    103096    40967  1520505359  1519776000
3    2868330    147277    43599  1520505359  1519776000
4    2868331    224682    40447  1520505359  1519776000

In [15]:
df.to_csv("rt_vehicles_DB_2018_cleaned.csv", index=False)

<h3>Sample for Download</h3>

In [16]:
# Define function to convert datetime in format seen in data to timestamp
def to_timestamp2(x):
    out = int(datetime.timestamp(datetime.strptime(x, '%d-%b-%Y %H:%M')))
    return out

In [17]:
start_date = to_timestamp2("05-mar-2018 00:00")
end_date = to_timestamp2("11-mar-2018 23:00") 
mar_df = df[df["dt"] >= start_date]
mar_df.head(5)

    VEHICLEID  DISTANCE  MINUTES  LASTUPDATE          dt
0     3303848    286166    58849  1543910589  1542931200
1     3303847    259545    56828  1543910589  1542931200
89    2868335    214200    57959  1530534720  1529622000
90    2868336    173589    59660  1530534720  1529622000
91    2868337    120299    47519  1530534720  1529622000

In [18]:
mar_df.shape

(226160, 5)

In [19]:
mar_df = mar_df[(mar_df["dt"]) <= end_date]
print("Number of rows in subset: ", mar_df.shape[0])

Number of rows in subset:  5507

In [23]:
mar_df.sort_values(by="dt", inplace=True)

In [25]:
mar_df.head()

       VEHICLEID  DISTANCE  MINUTES  LASTUPDATE          dt
63849    2693254    245831    35442  1521188059  1520208000
47830    1000170    167754    49433  1521188059  1520208000
47831    2534815    222226    60173  1521188059  1520208000
47832    2172272    187756    52430  1521188059  1520208000
47833    1001241     96704    41653  1521188059  1520208000

In [24]:
mar_df.tail()

       VEHICLEID  DISTANCE  MINUTES  LASTUPDATE          dt
50715    2534798    115779    28383  1521471779  1520726400
50716    2534803    117302    32130  1521471779  1520726400
50717    2534805    163071    36640  1521471779  1520726400
50704    2406918    190705    52131  1521471779  1520726400
50772    2693211    155021    49776  1521471779  1520726400

In [26]:
mar_df.to_csv("5_11_march_vehicles.csv", index=False)